# На числовой прямой даны два отрезка:
# D = [17; 58] и C = [29; 80].
# Укажите наименьшую возможную длину такого отрезка A,
# для которого логическое выражение
# (x ∈ D) → ((¬(x ∈ C) ∧ ¬(x ∈ A)) → ¬(x ∈ D))
# истинно (т.е. принимает значение 1) при любом значении переменной х.

u = 4
def f(x, a1, a2):
    D = 17 * u <= x <= 58 * u
    C = 29 * u <= x <= 80 * u
    A = a1 <= x <= a2
    return D <= (((not C) and (not A)) <= (not D))


m = 999999
for a1 in range(15 * u, 85 * u):
    for a2 in range(a1, 85 * u):
        if all(f(x, a1, a2) for x in range(15 * 4, 85 * 4)):
            m = min(m, a2 - a1)

print(m / 4)
