# На числовой прямой даны два отрезка:
# P = [17; 54] и Q = [37; 83].
# Укажите наименьшую возможную длину такого отрезка A,
# что логическое выражение
# (x ∈ P) → (((x ∈ Q) ∧ ¬(x ∈ A)) → ¬(x ∈ P))
#  истинно (т.е. принимает значение 1) при любом значении переменной х.
m = 999999
u = 4
for a1 in range(15 * u, 85 * u):
    for a2 in range(a1, 85 * u):
        for x in range(15 * u, 85 * u):
            P = 17 * u <= x <= 54 * u
            Q = 37 * u <= x <= 83 * u
            A = a1 <= x <= a2
            f = P <= ((Q and (not A)) <= (not P))
            if not f:
                break
        else:
            m = min(m, a2 - a1)

print(m / u)
